In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression

In [2]:
# df = pd.read_csv("titanic.csv")
df = pd.read_csv("Titanic-Dataset.csv")

In [3]:
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
data = df.copy()

In [6]:
data.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
368,369,1,3,"Jermyn, Miss. Annie",female,NaN,0,0,14313,7.75,NaN,Q

In [7]:
data["Pclass"] = data["Pclass"].replace({1:"first class",2:"second class",3:"third class"})

In [8]:
data["Embarked"] = data["Embarked"].replace({"C":"Cherbourg","Q":"Queenstown","S":"Southampton"})

In [9]:
data.sample(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
718,719,0,third class,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.5000,NaN,Queenstown
645,646,1,first class,"Harper, Mr. Henry Sleeper",male,48.0,1,0,PC 17572,76.7292,D33,Cherbourg
376,377,1,third class,"Landergren, Miss. Aurora Adelia",female,22.0,0,0,C 7077,7.2500,NaN,Southampton

In [10]:
data.drop(["PassengerId","Name","Ticket","Cabin","Fare","SibSp","Parch"],axis=1,inplace=True)

In [11]:
data.sample()

    Survived       Pclass     Sex   Age     Embarked
79         1  third class  female  30.0  Southampton

In [12]:
data = pd.get_dummies(data,"Embarked")

In [13]:
data.sample()

,Survived,Age,Embarked_first class,Embarked_second class,Embarked_third class,Embarked_female,Embarked_male,Embarked_Cherbourg,Embarked_Queenstown,Embarked_Southampton
808,0,39.0,0,1,0,0,1,0,0,1

In [14]:
data = pd.get_dummies(data,"Pclass")

In [15]:
data.sample()

,Survived,Age,Embarked_first class,Embarked_second class,Embarked_third class,Embarked_female,Embarked_male,Embarked_Cherbourg,Embarked_Queenstown,Embarked_Southampton
414,1,44.0,0,0,1,0,1,0,0,1

In [16]:
data.isnull().sum()

Survived                   0
Age                      177
Embarked_first class       0
Embarked_second class      0
Embarked_third class       0
Embarked_female            0
Embarked_male              0
Embarked_Cherbourg         0
Embarked_Queenstown        0
Embarked_Southampton       0
dtype: int64

In [17]:
data["Age"] = data["Age"].fillna(data['Age'].median())

In [18]:
data.isnull().sum()

Survived                 0
Age                      0
Embarked_first class     0
Embarked_second class    0
Embarked_third class     0
Embarked_female          0
Embarked_male            0
Embarked_Cherbourg       0
Embarked_Queenstown      0
Embarked_Southampton     0
dtype: int64

In [19]:
X = data.drop("Survived",axis=1)
y = data["Survived"]

In [20]:
X.sample()

,Age,Embarked_first class,Embarked_second class,Embarked_third class,Embarked_female,Embarked_male,Embarked_Cherbourg,Embarked_Queenstown,Embarked_Southampton
140,28.0,0,0,1,1,0,1,0,0

In [21]:
y.sample()

433    0
Name: Survived, dtype: int64

In [22]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [139]:
classifier = RandomForestClassifier(n_estimators=7,oob_score=True)

In [140]:
classifier.fit(X_train,y_train)

D:\Python_3.9.9\lib\site-packages\sklearn\ensemble\_forest.py:541: UserWarning: Some inputs do not have OOB scores. This probably means too few trees were used to compute any reliable oob estimates.
  warn("Some inputs do not have OOB scores. "
D:\Python_3.9.9\lib\site-packages\sklearn\ensemble\_forest.py:545: RuntimeWarning: invalid value encountered in true_divide
  decision = (predictions[k] /

RandomForestClassifier(n_estimators=7, oob_score=True)

In [141]:
pred = classifier.predict(X_test)

In [142]:
pred

array([0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       1, 0, 0], dtype=int64)

In [143]:
# list(y_test)

In [144]:
y_test.tail(10)

500    0
222    0
1      1
425    0
760    0
780    1
837    0
215    1
833    0
372    0
Name: Survived, dtype: int64

In [145]:
from sklearn.metrics import accuracy_score,confusion_matrix
accuracy_score(y_test,pred)

0.8379888268156425

In [40]:
confusion_matrix(y_test,pred)

array([[94, 16],
       [20, 49]], dtype=int64)